As this PR stands, not rebased of #4810, the `aws_sns_topic` resource isn't yet declared in the module and therefore unable to validate. Conversely, a valid plan is generated when this changes are rebased of #4810.

```
❯ CI_COMMIT_REF_NAME=develop make plan
python /Users/achave11/Pycharm/Azul/azul.sc/scripts/check_branch.py
python providers.tf.json.template.py providers.tf.json
Creating providers.tf.json
python backend.tf.json.template.py backend.tf.json
Creating backend.tf.json
terraform init -reconfigure

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/external from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Reusing previous version of hashicorp/google from the dependency lock file
- Using previously-installed hashicorp/aws v4.30.0
- Using previously-installed hashicorp/external v2.2.0
- Using previously-installed hashicorp/null v3.2.0
- Using previously-installed hashicorp/google v3.90.1

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
python common.tf.json.template.py common.tf.json
Creating common.tf.json
python shared.tf.json.template.py shared.tf.json
Creating shared.tf.json
terraform validate
Success! The configuration is valid.

terraform plan
…Refreshing state...

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudformation_stack.chatbot will be created
  + resource "aws_cloudformation_stack" "chatbot" {
      + id            = (known after apply)
      + name          = "azul-chatbot-dev"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags          = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all      = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + template_body = (known after apply)
    }

  # aws_iam_role.chatbot will be created
  + resource "aws_iam_role" "chatbot" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "chatbot.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "azul-chatbot-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all              = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "hca"
          + "component"           = "azul-chatbot"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.chatbot will be created
  + resource "aws_iam_role_policy" "chatbot" {
      + id     = (known after apply)
      + name   = "azul-chatbot-dev"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:Describe*",
                          + "cloudwatch:Get*",
                          + "cloudwatch:List*",
                          + "sns:Get*",
                          + "sns:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.logs will be updated in-place
  ~ irrelevant…

  # aws_s3_bucket_lifecycle_configuration.versioned will be updated in-place
  ~ irrelevant…

  # aws_sns_topic.monitoring will be created
  + resource "aws_sns_topic" "monitoring" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "azul-monitoring-dev"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "Name"                = "azul-monitoring"
          + "billing"             = "hca"
          + "component"           = "azul-monitoring"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      + tags_all                    = {
          + "Name"                = "azul-monitoring"
          + "billing"             = "hca"
          + "component"           = "azul-monitoring"
          + "deployment"          = "dev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
    }

  # aws_sns_topic_subscription.monitoring will be created
  + resource "aws_sns_topic_subscription" "monitoring" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "azul-group@ucsc.edu"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 5 to add, 2 to change, 0 to destroy.
```